[
    {
        "name": "Asparagus-Stuffed Chicken Breast",
        "description": "Boneless chicken breast are stuffed with a mixture of asparagus, cream cheese, and Parmesan, then baked until tender and juicy: Serves 4",
        "instructions": "1) Preheat oven to 425°F. 2) On a cutting board, cut the chicken breast in half, lengthwise, leaving it intact on one side. 3) Season the inside of the chicken with salt and pepper. 4) Sprinkle the lemon zest on the interrior of the chicken, Top with piece of provolone and three stalks of asparagus, then fold the chicken over enclosing the filling. 5) Season the outside of the chicken breast with salt pepper garlic powder and paprika. 6) Heat a large oven-safe skillet over medium-high heat and add the oil Add the chicken to the pan and cook for 3 to 5 minutes, util golden brown. 7) Flip the chicken over and cook for an additional 3 to 5 minutes. 8) Cover the skillet with aluminum foil and place in the oven for 15 minutes, or until the internal temperature reaches 155°F. 9) Remove the skillet and let sit, covered, for 5 minutes. 10) Remove the foil, and serve.",
        "has_nuts": "false",
        "user_id": 2
    },
    {
        "name": "Poppy Seed Chicken",
        "description": "Creamy chicken casserole: Serves 8",
        "instructions": "1) Preheat oven to 350°F. 2) Place cubed chicken in a 9X13 casserole dish. 3) Stir together the condensed soup and sour cream, Pour over the chiken. 4) In a seperate bowl, stir together the crushed creackers and melted butter, Sprinkle over the chicken and sauce, Sprinkle the poppy seeds on top. 5) Bake for 20-30 minutes in the preheated oven, until the etop of the casserole is browned and the sauce is bubbly, Serve plain or over rice.",
        "has_nuts": "false",
        "user_id": 3
    },
    {
        "name": "The Best Scalloped Potatoes",
        "description": "Creamy, cheesy and perfectly indulgent, scalloped potatoes: Serves 4-6",
        "instructions": "1) Preheat the oven to 350 degrees F. Grease an 8-inch square baking dish with unsalted butter. 2) Peel the potatoes and cut them into 1/8-inch-thick slices using a mandoline or sharp knife. 3) Add the sliced potatoes, heavy cream, whole milk, 2 tablespoons butter, garlic, thyme, 1 1/2 teaspoons salt, 1/2 teaspoon pepper and the nutmeg to a medium saucepan. Bring to a simmer over medium heat and cook, stirring occasionally, until the potatoes are tender and almost cooked through but still hold their shape, about 5 minutes. (They should not be soft and falling apart.) Remove the saucepan from the heat. 4)Add the Gruyere and Parmesan, stirring gently to combine. Pour the potato mixture into the prepared baking dish. Bake until the top is light golden brown and the potatoes are cooked through and tender, about 45 minutes. Let rest for 10 minutes before serving. ",       
        "has_nuts": "false",
        "user_id": 4
    },
    {
        "name": "Chicken Shawarma",
        "description": "",
        "instructions": "1) SPICE MIXTURE: In a medium bowl, whisk together olive oil, water, lemon zest, lemon juice, garlic, coriander, paprika, cumin, turmeric, cinnamon, ginger, cayenne pepper, cardamom, 1 teaspoon salt and 1/2 teaspoon pepper. 2) In a gallon size Ziploc bag or large bowl, combine chicken and SPICE MIXTURE; marinate for at least 2 hours to overnight, turning the bag occasionally. Drain the chicken from the marinade. 3) Preheat grill to medium high heat. 4) Brush chicken with canola oil; season with salt and pepper, to taste. 5) Add chicken to grill, and cook, turning occasionally, until chicken is completely cooked through, reaching an internal temperature of 165 degrees F, about 10 minutes. 6) Serve immediately with tzatziki sauce.",
        "has_nuts": "false",
        "user_id": 5
    }
]